app/Http/Controllers/Admin/ProjectController.php

select * from `projects`
---
    public function index()
    {
        //
        $projects  = Project::all();

delete from `projects` where `id` = 11
---
    public function destroy(Project $project)
    {
        //
        $project->delete();