app/Http/Controllers/Admin/TaskController.php

    public function index()
    {
        ///get tasks
        $tasks = Task::all();
---
select * from `tasks`

    public function create()
    {
        //return view create task
        $users = User::all();
        $projects = Project::all();
        $activities = Activity::all();
---
select * from `users`
select * from `projects`
select * from `activities`

    public function store(TaskStoreRequest $request)
    {
        $task = new Task();
        $task->task = $request->task;
        $task->begindate = $request->begindate;
        $task->enddate = $request->enddate;
        $task->user_id = $request->user_id;
        $task->project_id = $request->project_id;
        $task->activity_id = $request->activity_id;
        $task->save();
---
insert into `tasks` (`task`, `begindate`, `enddate`, `user_id`, `project_id`, `activity_id`, `updated_at`, `created_at`) values ('Rogelio Oberbruneneeweweweweweewe', '2021-12-17', '2021-12-24', '2', '5', '4', '2021-12-15 12:50:58', '2021-12-15 12:50:58')

    public function edit(Task $task)
    {
        //
        $users = User::all();
        $projects = Project::all();
        $activities = Activity::all();
---
select * from `users`
select * from `projects`
select * from `activities`

    public function delete(Task $task) {
        $users = User::all();
        $projects = Project::all();
        $activities = Activity::all();
---
select * from `users`
select * from `projects`
select * from `activities`

    public function destroy(Task $task)
    {
        //
        $task->delete();
---
delete from `tasks` where `id` = 9